Terraform plan in __terraform/awsk3s01__
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.velero will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "velero"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ec2:CreateSnapshot",
              + "ec2:CreateTags",
              + "ec2:CreateVolume",
              + "ec2:DeleteSnapshot",
              + "ec2:DescribeSnapshots",
              + "ec2:DescribeVolumes",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:AbortMultipartUpload",
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListMultipartUploadParts",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_iam_access_key.velero will be created
  + resource "aws_iam_access_key" "velero" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "awsk3s01-velero"
    }

  # aws_iam_policy.velero will be created
  + resource "aws_iam_policy" "velero" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "awsk3s01-velero"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_user.velero will be created
  + resource "aws_iam_user" "velero" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "awsk3s01-velero"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.velero will be created
  + resource "aws_iam_user_policy_attachment" "velero" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "awsk3s01-velero"
    }

  # aws_s3_bucket.velero will be created
  + resource "aws_s3_bucket" "velero" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "awsk3s01-velero"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Warning: Provider aws is undefined

  on main.tf line 159, in module "k3s":
 159:     aws = aws

Module module.k3s does not declare a provider named aws.
If you wish to specify a provider configuration for the module, add an entry
for aws in the required_providers block within the module.
```
</details>

:x: Plan not applied in [AWSK3S01 Trunk Apply #10](https://github.com/yardbirdsax/infra-k8slab/actions/runs/1542544617) (Plan has changed)